IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC A(30).
01 WS-ID PIC 9(3).
PROCEDURE DIVISION.
ACCEPT WS-NAME.
ACCEPT WS-ID.
DISPLAY WS-ID.
DISPLAY WS-NAME.
STOP RUN.
