IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC X(9) VALUE 'ABCD'.
01 NUM2 PIC 9(9) VALUE 123456789.
PROCEDURE DIVISION.
IF NUM1 IS ALPHABETIC THEN
DISPLAY "NUM1 IS ALPHABETIC.".
IF NUM1 IS NUMERIC THEN
DISPLAY "NUM1 IS NUMERIC.".
IF NUM2 IS NUMERIC THEN
DISPLAY "NUM2 IS NUMERIC.".
STOP RUN.
