IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM PIC S9(3)V9(2).
01 WS-NUM2 PIC V9(2).

PROCEDURE DIVISION.
MOVE 00.12 TO WS-NUM2.
DISPLAY "WS-NUM: " WS-NUM.
DISPLAY "WS-NUM2:"WS-NUM2.
STOP RUN.
