IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM1 PIC 9(2).
01 NUM2 PIC 9(2).

PROCEDURE DIVISION.

MOVE 25 TO NUM1.
MOVE 45 TO NUM2.

IF NUM1 IS GREATER THAN OR EQUAL TO NUM2
DISPLAY "NUM1 IS GREATER THAN NUM2."

ELSE 
DISPLAY "NUM 2 IS GREATR THAN NUM1."

END-IF.

DISPLAY 'Hello, world'.
STOP RUN.
