IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
    WORKING-STORAGE SECTION.

    01 WS-NUM1 PIC S9(9) VALUE -1789.
    01 WS-NUM2 PIC S9(9) VALUE 1686.

PROCEDURE DIVISION.

    IF WS-NUM1 IS POSITIVE THEN
        DISPLAY ' NUM1 IS POSITIVE'.

    IF WS-NUM1 IS NEGATIVE THEN
        DISPLAY 'NUM1 IS NEGATIVE '.

    IF WS-NUM1 IS ZERO THEN
        DISPLAY 'NUM1 IS ZERO'.

    IF WS-NUM2 IS POSITIVE THEN
        DISPLAY 'NUM2 IS POSITIVE'.

STOP RUN.
