IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM1 PIC 9(2).
01 NUM2 PIC 9(2).
01 NUM3 PIC 9(2).
01 NUM4 PIC 9(2).

PROCEDURE DIVISION.

MOVE 25 TO NUM1 NUM3.
MOVE 45 TO NUM2 NUM4.

IF NUM1>NUM2 THEN
DISPLAY "IN LOOP 1 IF BLOCK."

   IF NUM3=NUM4 THEN
   DISPLAY "IN LOOP 2 IF BLOCK."

   ELSE 
   DISPLAY "IN LOOP 2 ELSE BLOCK."
   END-IF

ELSE
DISPLAY "IN LOOP 1 ELSE BLOCK."

END-IF.

DISPLAY 'Hello, world'.
STOP RUN.
