IDENTIFICATION DIVISION. 
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WHO            PIC X(15).
01 WHERE          PIC X(25).
01 WHY            PIC X(35).
01 RATE           PIC 9(2).
01 HOUR           PIC 9(2)V99.
01 GROSS-PAY      PIC 9(3)V99.
PROCEDURE DIVISION.
MOVE "CAPTAIN COBOL: " TO WHO.
MOVE "GERMANY :"    TO WHERE.
MOVE "TO LEARN :"    TO WHY.
MOVE 19    TO RATE.
MOVE 29.7    TO HOUR.
COMPUTE GROSS-PAY = (HOUR) * (RATE).
DISPLAY "WHO IS: " WHO.
DISPLAY "WHERE IS: " WHERE.
DISPLAY "WHY IS: " WHY.
DISPLAY "RATE IS: " RATE.
DISPLAY "HOUR IS: " HOUR.
DISPLAY "GROSS-PAY: " GROSS-PAY.

STOP RUN.

