IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC A(30).
01 WS-ID PIC 9(3).
01 WS-ADDRESS PIC A(10).
PROCEDURE DIVISION.
INITIALIZE WS-NAME,WS-ADDRESS.
INITIALIZE WS-ID REPLACING NUMERIC DATA BY 123.
DISPLAY WS-NAME.
DISPLAY WS-ADDRESS.
DISPLAY WS-ID.
STOP RUN.
