IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
ENVIRONMENT DIVISION.
DATA DIVISION.

PROCEDURE DIVISION.
PERFORM 100-PARA.
STOP RUN.
100-PARA.
DISPLAY '100 PARA IS THIS'.
   
