IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 WS-I PIC 9(1) VALUE 1.
PROCEDURE DIVISION.
PERFORM 100-PARA UNTIL WS-I>5.
STOP RUN.
100-PARA.
COMPUTE WS-I = WS-I + 1
DISPLAY "CMP PGM WS-I:  "WS-I.
