IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 9(3).
01 WS-B PIC 9(3).
01 WS-C PIC 9(4).
PROCEDURE DIVISION.
MOVE 100 TO WS-C.
MOVE 100 TO WS-B.
COMPUTE WS-A=WS-C+WS-B.
DISPLAY "C VALUE ",WS-C.
DISPLAY "B VALUE " WS-B.
DISPLAY "A VALUE " WS-A.
STOP RUN.
